; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v5 ?v10)
             (pred_12 ?v7 ?v1)
             (pred_9 ?v5 ?v1)
             (pred_11 ?v8 ?v5 )
	     (pred_6 ?v5)
             (pred_3 ?v11)
             (pred_8 ?v7)
             (pred_7 ?v1)
             (pred_5 ?v5)
             (pred_2 ?v7)
             (pred_4 ?v5)
             (pred_1 ))



(:action op_4
:parameters (?v12 ?v6 ?v4 ?v13)
:precondition (and (pred_3 ?v12) (pred_3 ?v6) (pred_8 ?v4) (pred_7 ?v13)
          (pred_10 ?v12 ?v6) (pred_12 ?v4 ?v13)
                   (pred_9 ?v6 ?v13) (pred_6 ?v12) 
                   (pred_5 ?v6) (pred_2 ?v4))
:effect (and  (pred_4 ?v6) (not (pred_5 ?v6))))


(:action op_2
:parameters (?v12 ?v2)
:precondition (and (pred_3 ?v12) (pred_3 ?v2)
               (pred_6 ?v12) (pred_10 ?v12 ?v2) (pred_4 ?v2))
:effect (and (pred_6 ?v2) (not (pred_6 ?v12))))

(:action op_5
:parameters (?v12 ?v4)
:precondition (and (pred_3 ?v12) (pred_8 ?v4) 
                  (pred_6 ?v12) (pred_11 ?v4 ?v12) (pred_1 ))
:effect (and (pred_2 ?v4)
   (not (pred_11 ?v4 ?v12)) (not (pred_1 ))))


(:action op_1
:parameters (?v12 ?v3 ?v9)
:precondition (and (pred_3 ?v12) (pred_8 ?v3) (pred_8 ?v9)
                  (pred_6 ?v12) (pred_2 ?v9) (pred_11 ?v3 ?v12))
:effect (and (pred_2 ?v3) (pred_11 ?v9 ?v12)
        (not (pred_2 ?v9)) (not (pred_11 ?v3 ?v12))))

(:action op_3
:parameters (?v12 ?v4)
:precondition (and (pred_3 ?v12) (pred_8 ?v4) 
                  (pred_6 ?v12) (pred_2 ?v4))
:effect (and (pred_1 ) (pred_11 ?v4 ?v12) (not (pred_2 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_08 obj_03 obj_27 obj_22 obj_21 obj_13 obj_25 obj_29 obj_07 obj_28 obj_18 obj_06 obj_19 obj_15 obj_11 obj_10 obj_26 obj_05 obj_02 obj_30 obj_20 obj_24 obj_12 obj_23
    obj_14 obj_09
    obj_01 obj_16 obj_17
    )

    (:init
       (pred_1)

       (pred_3 obj_04)
       (pred_3 obj_08)
       (pred_3 obj_03)
       (pred_3 obj_27)
       (pred_3 obj_22)
       (pred_3 obj_21)
       (pred_3 obj_13)
       (pred_3 obj_25)
       (pred_3 obj_29)
       (pred_3 obj_07)
       (pred_3 obj_28)
       (pred_3 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_19)
       (pred_3 obj_15)
       (pred_3 obj_11)
       (pred_3 obj_10)
       (pred_3 obj_26)
       (pred_3 obj_05)
       (pred_3 obj_02)
       (pred_3 obj_30)
       (pred_3 obj_20)
       (pred_3 obj_24)
       (pred_3 obj_12)
       (pred_3 obj_23)
       (pred_7 obj_14)
       (pred_7 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_16)
       (pred_8 obj_17)

       (pred_10 obj_04 obj_21)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_03 obj_25)
       (pred_10 obj_03 obj_27)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_27 obj_29)
       (pred_10 obj_27 obj_22)
       (pred_10 obj_27 obj_03)
       (pred_10 obj_22 obj_07)
       (pred_10 obj_22 obj_27)
       (pred_10 obj_21 obj_28)
       (pred_10 obj_21 obj_13)
       (pred_10 obj_21 obj_04)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_25)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_13 obj_21)
       (pred_10 obj_25 obj_06)
       (pred_10 obj_25 obj_29)
       (pred_10 obj_25 obj_03)
       (pred_10 obj_25 obj_13)
       (pred_10 obj_29 obj_19)
       (pred_10 obj_29 obj_07)
       (pred_10 obj_29 obj_27)
       (pred_10 obj_29 obj_25)
       (pred_10 obj_07 obj_15)
       (pred_10 obj_07 obj_22)
       (pred_10 obj_07 obj_29)
       (pred_10 obj_28 obj_11)
       (pred_10 obj_28 obj_18)
       (pred_10 obj_28 obj_21)
       (pred_10 obj_18 obj_10)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_18 obj_28)
       (pred_10 obj_06 obj_26)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_25)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_19 obj_05)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_19 obj_29)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_15 obj_07)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_11 obj_30)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_28)
       (pred_10 obj_10 obj_20)
       (pred_10 obj_10 obj_26)
       (pred_10 obj_10 obj_18)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_26 obj_24)
       (pred_10 obj_26 obj_05)
       (pred_10 obj_26 obj_06)
       (pred_10 obj_26 obj_10)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_05 obj_26)
       (pred_10 obj_02 obj_23)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_30 obj_20)
       (pred_10 obj_30 obj_11)
       (pred_10 obj_20 obj_24)
       (pred_10 obj_20 obj_10)
       (pred_10 obj_20 obj_30)
       (pred_10 obj_24 obj_12)
       (pred_10 obj_24 obj_26)
       (pred_10 obj_24 obj_20)
       (pred_10 obj_12 obj_23)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_24)
       (pred_10 obj_23 obj_02)
       (pred_10 obj_23 obj_12)
       (pred_5 obj_25)
       (pred_5 obj_23)
       (pred_5 obj_19)
       (pred_9  obj_25 obj_14)
       (pred_9  obj_23 obj_09)
       (pred_9  obj_19 obj_09)
       (pred_4 obj_04)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_27)
       (pred_4 obj_22)
       (pred_4 obj_21)
       (pred_4 obj_13)
       (pred_4 obj_29)
       (pred_4 obj_07)
       (pred_4 obj_28)
       (pred_4 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_4 obj_26)
       (pred_4 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_30)
       (pred_4 obj_20)
       (pred_4 obj_24)
       (pred_4 obj_12)

       (pred_12  obj_01 obj_14)
       (pred_12  obj_16 obj_09)
       (pred_12  obj_17 obj_09)
       (pred_11 obj_01 obj_15)
       (pred_11 obj_16 obj_02)
       (pred_11 obj_17 obj_24)
       (pred_6 obj_22)
    )

    (:goal (and
       (pred_11 obj_17 obj_19)
    ))
(:constraints
  (always (not (pred_6 obj_26)))
)
)

; plan
1. (op_2 obj_22 obj_07)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_07)
   goals met: 0 of 1
2. (op_2 obj_07 obj_15)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_15)
   goals met: 0 of 1
3. (op_2 obj_15 obj_02)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_02)
   goals met: 0 of 1
4. (op_2 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 0 of 1
5. (op_2 obj_05 obj_12)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_12)
   goals met: 0 of 1
6. (op_2 obj_12 obj_24)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_24)
   goals met: 0 of 1
7. (op_5 obj_24 obj_17)
   deleted: (pred_11 obj_17 obj_24) (pred_1)
   added: (pred_2 obj_17)
   goals met: 0 of 1
8. (op_2 obj_24 obj_12)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_12)
   goals met: 0 of 1
9. (op_2 obj_12 obj_05)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_05)
   goals met: 0 of 1
10. (op_4 obj_05 obj_19 obj_17 obj_09)
   deleted: (pred_5 obj_19)
   added: (pred_4 obj_19)
   goals met: 0 of 1
11. (op_2 obj_05 obj_19)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_19)
   goals met: 0 of 1
12. (op_3 obj_19 obj_17)
   deleted: (pred_2 obj_17)
   added: (pred_1) (pred_11 obj_17 obj_19)
   goals met: 1 of 1
